erik-elemind/monorepo/board/pin_mux.h
/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_DEBUG_LEDn_GPIO GPIO                 /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_DEBUG_LEDn_GPIO_PIN_MASK (1U << 14U) /*!<@brief GPIO pin mask */
#define BOARD_INITPINS_DEBUG_LEDn_PORT 0U                   /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_DEBUG_LEDn_PIN 14U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_DEBUG_LEDn_PIN_MASK (1U << 14U)      /*!<@brief PORT pin mask */
                                                            /* @} */

/*! @name PIO0_15 (coord A5), BLE_RESETn
  @{ */
/* Routed pin properties */
#define BOARD_INITPINS_BLE_RESETn_PERIPHERAL GPIO           /*!<@brief Peripheral name */
#define BOARD_INITPINS_BLE_RESETn_SIGNAL PIO0               /*!<@brief Signal name */
#define BOARD_INITPINS_BLE_RESETn_CHANNEL 15                /*!<@brief Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_BLE_RESETn_GPIO GPIO                 /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_BLE_RESETn_GPIO_PIN_MASK (1U << 15U) /*!<@brief GPIO pin mask */
#define BOARD_INITPINS_BLE_RESETn_PORT 0U                   /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_BLE_RESETn_PIN 15U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_BLE_RESETn_PIN_MASK (1U << 15U)      /*!<@brief PORT pin mask */
                                                            /* @} */

/*! @name FC2_CTS_SDA_SSEL0 (coord D7), I2C5_SDA
  @{ */
/* Routed pin properties */
#define BOARD_INITPINS_I2C5_SDA_PERIPHERAL FLEXCOMM2       /*!<@brief Peripheral name */
#define BOARD_INITPINS_I2C5_SDA_SIGNAL CTS_SDA_SSEL0       /*!<@brief Signal name */
                                                           /* @} */

/*! @name FC2_RTS_SCL_SSEL1 (coord B7), I2C5_SCL
  @{ */
/* Routed pin properties */
#define BOARD_INITPINS_I2C5_SCL_PERIPHERAL FLEXCOMM2       /*!<@brief Peripheral name */
#define BOARD_INITPINS_I2C5_SCL_SIGNAL RTS_SCL_SSEL1       /*!<@brief Signal name */
                                                           /* @} */

/*! @name PIO0_19 (coord A1), BAT_INTn
  @{ */
/* Routed pin properties */
#define BOARD_INITPINS_BAT_INTn_PERIPHERAL PINT           /*!<@brief Peripheral name */
#define BOARD_INITPINS_BAT_INTn_SIGNAL PINT               /*!<@brief Signal name */
#define BOARD_INITPINS_BAT_INTn_CHANNEL 1                 /*!<@brief Signal channel */
#define BOARD_INITPINS_BAT_INTn_PORT 0U                   /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_BAT_INTn_PIN 19U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_BAT_INTn_PIN_MASK (1U << 19U)      /*!<@brief PORT pin mask */
                                                          /* @} */

/*! @name PIO0_21 (coord C7), BAT_STATn
  @{ */
/* Routed pin properties */
#define BOARD_INITPINS_BAT_STATn_PERIPHERAL GPIO           /*!<@brief Peripheral name */
#define BOARD_INITPINS_BAT_STATn_SIGNAL PIO0               /*!<@brief Signal name */
#define BOARD_INITPINS_BAT_STATn_CHANNEL 21                /*!<@brief Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_BAT_STATn_GPIO GPIO                 /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_BAT_STATn_GPIO_PIN_MASK (1U << 21U) /*!<@brief GPIO pin mask */
#define BOARD_INITPINS_BAT_STATn_PORT 0U                   /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_BAT_STATn_PIN 21U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_BAT_STATn_PIN_MASK (1U << 21U)      /*!<@brief PORT pin mask */
                                                           /* @} */

/*! @name PIO0_23 (coord C9), BAT_CD
  @{ */
/* Routed pin properties */
#define BOARD_INITPINS_BAT_CD_PERIPHERAL GPIO           /*!<@brief Peripheral name */
#define BOARD_INITPINS_BAT_CD_SIGNAL PIO0               /*!<@brief Signal name */
#define BOARD_INITPINS_BAT_CD_CHANNEL 23                /*!<@brief Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_BAT_CD_GPIO GPIO                 /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_BAT_CD_GPIO_PIN_MASK (1U << 23U) /*!<@brief GPIO pin mask */
#define BOARD_INITPINS_BAT_CD_PORT 0U                   /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_BAT_CD_PIN 23U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_BAT_CD_PIN_MASK (1U << 23U)      /*!<@brief PORT pin mask */
                                                        /* @} */

/*! @name FC3_CTS_SDA_SSEL0 (coord B9), I2C6_SDA
  @{ */
/* Routed pin properties */
#define BOARD_INITPINS_I2C6_SDA_PERIPHERAL FLEXCOMM3       /*!<@brief Peripheral name */
#define BOARD_INITPINS_I2C6_SDA_SIGNAL CTS_SDA_SSEL0       /*!<@brief Signal name */
                                                           /* @} */

/*! @name FC3_RTS_SCL_SSEL1 (coord A9), I2C6_SCL
  @{ */
/* Routed pin properties */
#define BOARD_INITPINS_I2C6_SCL_PERIPHERAL FLEXCOMM3       /*!<@brief Peripheral name */
#define BOARD_INITPINS_I2C6_SCL_SIGNAL RTS_SCL_SSEL1       /*!<@brief Signal name */
                                                           /* @} */

/*! @name SCT0_OUT6 (coord A2), LEDG_PWM
  @{ */
/* Routed pin properties */
#define BOARD_INITPINS_LEDG_PWM_PERIPHERAL SCT0    /*!<@brief Peripheral name */
#define BOARD_INITPINS_LEDG_PWM_SIGNAL OUT         /*!<@brief Signal name */
#define BOARD_INITPINS_LEDG_PWM_CHANNEL 6          /*!<@brief Signal channel */
                                                   /* @} */

/*! @name SCT0_OUT7 (coord B3), LEDR_PWM
  @{ */
/* Routed pin properties */
#define BOARD_INITPINS_LEDR_PWM_PERIPHERAL SCT0    /*!<@brief Peripheral name */
#define BOARD_INITPINS_LEDR_PWM_SIGNAL OUT         /*!<@brief Signal name */
#define BOARD_INITPINS_LEDR_PWM_CHANNEL 7          /*!<@brief Signal channel */
                                                   /* @} */

/*! @name FC4_SCK (coord D11), SSM2518_BCLK
  @{ */
/* Routed pin properties */
#define BOARD_INITPINS_SSM2518_BCLK_PERIPHERAL FLEXCOMM4 /*!<@brief Peripheral name */
#define BOARD_INITPINS_SSM2518_BCLK_SIGNAL SCK           /*!<@brief Signal name */
                                                         /* @} */

/*! @name FC4_TXD_SCL_MISO_WS (coord B10), SSM2518_LRCLK
  @{ */
/* Routed pin properties */
#define BOARD_INITPINS_SSM2518_LRCLK_PERIPHERAL FLEXCOMM4         /*!<@brief Peripheral name */
#define BOARD_INITPINS_SSM2518_LRCLK_SIGNAL TXD_SCL_MISO_WS       /*!<@brief Signal name */
                                                                  /* @} */

/*! @name FC4_RXD_SDA_MOSI_DATA (coord C11), SSM2518_SDATA
  @{ */
/* Routed pin properties */
#define BOARD_INITPINS_SSM2518_SDATA_PERIPHERAL FLEXCOMM4           /*!<@brief Peripheral name */
#define BOARD_INITPINS_SSM2518_SDATA_SIGNAL RXD_SDA_MOSI_DATA       /*!<@brief Signal name */
                                                                    /* @} */

/*! @name PIO0_31 (coord A11), MEMS_WAKE
  @{ */
/* Routed pin properties */
#define BOARD_INITPINS_MEMS_WAKE_PERIPHERAL GPIO           /*!<@brief Peripheral name */
#define BOARD_INITPINS_MEMS_WAKE_SIGNAL PIO0               /*!<@brief Signal name */
#define BOARD_INITPINS_MEMS_WAKE_CHANNEL 31                /*!<@brief Signal channel */

