erik-elemind/monorepo/board/pin_mux.h
/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_MEMS_WAKE_GPIO GPIO                 /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_MEMS_WAKE_GPIO_PIN_MASK (1U << 31U) /*!<@brief GPIO pin mask */
#define BOARD_INITPINS_MEMS_WAKE_PORT 0U                   /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_MEMS_WAKE_PIN 31U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_MEMS_WAKE_PIN_MASK (1U << 31U)      /*!<@brief PORT pin mask */
                                                           /* @} */

/*! @name PIO1_2 (coord A7), BLE_BOOTn
  @{ */
/* Routed pin properties */
#define BOARD_INITPINS_BLE_BOOTn_PERIPHERAL GPIO          /*!<@brief Peripheral name */
#define BOARD_INITPINS_BLE_BOOTn_SIGNAL PIO1              /*!<@brief Signal name */
#define BOARD_INITPINS_BLE_BOOTn_CHANNEL 2                /*!<@brief Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_BLE_BOOTn_GPIO GPIO                /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_BLE_BOOTn_GPIO_PIN_MASK (1U << 2U) /*!<@brief GPIO pin mask */
#define BOARD_INITPINS_BLE_BOOTn_PORT 1U                  /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_BLE_BOOTn_PIN 2U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_BLE_BOOTn_PIN_MASK (1U << 2U)      /*!<@brief PORT pin mask */
                                                          /* @} */

/*! @name PIO1_3 (coord G16), SSM2518_SHTDNn
  @{ */
/* Routed pin properties */
#define BOARD_INITPINS_SSM2518_SHTDNn_PERIPHERAL GPIO          /*!<@brief Peripheral name */
#define BOARD_INITPINS_SSM2518_SHTDNn_SIGNAL PIO1              /*!<@brief Signal name */
#define BOARD_INITPINS_SSM2518_SHTDNn_CHANNEL 3                /*!<@brief Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_SSM2518_SHTDNn_GPIO GPIO                /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_SSM2518_SHTDNn_GPIO_PIN_MASK (1U << 3U) /*!<@brief GPIO pin mask */
#define BOARD_INITPINS_SSM2518_SHTDNn_PORT 1U                  /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_SSM2518_SHTDNn_PIN 3U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_SSM2518_SHTDNn_PIN_MASK (1U << 3U)      /*!<@brief PORT pin mask */
                                                               /* @} */

/*! @name FC5_TXD_SCL_MISO_WS (coord G17), DEBUG_UART_TXD
  @{ */
/* Routed pin properties */
#define BOARD_INITPINS_DEBUG_UART_TXD_PERIPHERAL FLEXCOMM5         /*!<@brief Peripheral name */
#define BOARD_INITPINS_DEBUG_UART_TXD_SIGNAL TXD_SCL_MISO_WS       /*!<@brief Signal name */
                                                                   /* @} */

/*! @name FC5_RXD_SDA_MOSI_DATA (coord J16), DEBUG_UART_RXD
  @{ */
/* Routed pin properties */
#define BOARD_INITPINS_DEBUG_UART_RXD_PERIPHERAL FLEXCOMM5           /*!<@brief Peripheral name */
#define BOARD_INITPINS_DEBUG_UART_RXD_SIGNAL RXD_SDA_MOSI_DATA       /*!<@brief Signal name */
                                                                     /* @} */

/*! @name ADC0_4 (coord B5), MEMS_ANALOG
  @{ */
/* Routed pin properties */
#define BOARD_INITPINS_MEMS_ANALOG_PERIPHERAL ADC0     /*!<@brief Peripheral name */
#define BOARD_INITPINS_MEMS_ANALOG_SIGNAL CH           /*!<@brief Signal name */
#define BOARD_INITPINS_MEMS_ANALOG_CHANNEL 4           /*!<@brief Signal channel */
                                                       /* @} */

/*! @name PIO1_6 (coord J17), PB_INTn
  @{ */
/* Routed pin properties */
#define BOARD_INITPINS_PB_INTn_PERIPHERAL PINT          /*!<@brief Peripheral name */
#define BOARD_INITPINS_PB_INTn_SIGNAL PINT              /*!<@brief Signal name */
#define BOARD_INITPINS_PB_INTn_CHANNEL 2                /*!<@brief Signal channel */
#define BOARD_INITPINS_PB_INTn_PORT 1U                  /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_PB_INTn_PIN 6U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_PB_INTn_PIN_MASK (1U << 6U)      /*!<@brief PORT pin mask */
                                                        /* @} */

/*! @name PIO1_9 (coord B1), HRM_INTn
  @{ */
/* Routed pin properties */
#define BOARD_INITPINS_HRM_INTn_PERIPHERAL PINT          /*!<@brief Peripheral name */
#define BOARD_INITPINS_HRM_INTn_SIGNAL PINT              /*!<@brief Signal name */
#define BOARD_INITPINS_HRM_INTn_CHANNEL 3                /*!<@brief Signal channel */
#define BOARD_INITPINS_HRM_INTn_PORT 1U                  /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_HRM_INTn_PIN 9U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_HRM_INTn_PIN_MASK (1U << 9U)      /*!<@brief PORT pin mask */
                                                         /* @} */

/*! @name PIO1_10 (coord K16), ACCEL_INT
  @{ */
/* Routed pin properties */
#define BOARD_INITPINS_ACCEL_INT_PERIPHERAL PINT           /*!<@brief Peripheral name */
#define BOARD_INITPINS_ACCEL_INT_SIGNAL PINT               /*!<@brief Signal name */
#define BOARD_INITPINS_ACCEL_INT_CHANNEL 4                 /*!<@brief Signal channel */
#define BOARD_INITPINS_ACCEL_INT_PORT 1U                   /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_ACCEL_INT_PIN 10U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_ACCEL_INT_PIN_MASK (1U << 10U)      /*!<@brief PORT pin mask */
                                                           /* @} */

/*! @name PIO1_24 (coord T7), FLASH_MUX_SEL
  @{ */
/* Routed pin properties */
#define BOARD_INITPINS_FLASH_MUX_SEL_PERIPHERAL GPIO           /*!<@brief Peripheral name */
#define BOARD_INITPINS_FLASH_MUX_SEL_SIGNAL PIO1               /*!<@brief Signal name */
#define BOARD_INITPINS_FLASH_MUX_SEL_CHANNEL 24                /*!<@brief Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_FLASH_MUX_SEL_GPIO GPIO                 /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_FLASH_MUX_SEL_GPIO_PIN_MASK (1U << 24U) /*!<@brief GPIO pin mask */
#define BOARD_INITPINS_FLASH_MUX_SEL_PORT 1U                   /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_FLASH_MUX_SEL_PIN 24U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_FLASH_MUX_SEL_PIN_MASK (1U << 24U)      /*!<@brief PORT pin mask */
                                                               /* @} */

/*! @name PIO1_25 (coord U7), HRM_IR_ANODE_EN
  @{ */
/* Routed pin properties */
#define BOARD_INITPINS_HRM_IR_ANODE_EN_PERIPHERAL GPIO           /*!<@brief Peripheral name */
#define BOARD_INITPINS_HRM_IR_ANODE_EN_SIGNAL PIO1               /*!<@brief Signal name */
#define BOARD_INITPINS_HRM_IR_ANODE_EN_CHANNEL 25                /*!<@brief Signal channel */

