erik-elemind/monorepo/board/pin_mux.h
/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_ISP_ENTRY_GPIO GPIO                /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_ISP_ENTRY_GPIO_PIN_MASK (1U << 1U) /*!<@brief GPIO pin mask */
#define BOARD_INITPINS_ISP_ENTRY_PORT 1U                  /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_ISP_ENTRY_PIN 1U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_ISP_ENTRY_PIN_MASK (1U << 1U)      /*!<@brief PORT pin mask */
                                                          /* @} */

/*! @name PIO2_13 (coord T1), MEMS_MODE
  @{ */
/* Routed pin properties */
#define BOARD_INITPINS_MEMS_MODE_PERIPHERAL GPIO           /*!<@brief Peripheral name */
#define BOARD_INITPINS_MEMS_MODE_SIGNAL PIO2               /*!<@brief Signal name */
#define BOARD_INITPINS_MEMS_MODE_CHANNEL 13                /*!<@brief Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_MEMS_MODE_GPIO GPIO                 /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_MEMS_MODE_GPIO_PIN_MASK (1U << 13U) /*!<@brief GPIO pin mask */
#define BOARD_INITPINS_MEMS_MODE_PORT 2U                   /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_MEMS_MODE_PIN 13U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_MEMS_MODE_PIN_MASK (1U << 13U)      /*!<@brief PORT pin mask */
                                                           /* @} */

/*!
 * @brief 
 *
 */
void BOARD_InitPins(void); /* Function assigned for the Cortex-M33 */

#if defined(__cplusplus)
}
#endif

/*!
 * @}
 */
#endif /* _PIN_MUX_H_ */

/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
